{
  "updatedAt": "2025-10-15T00:48:09.385Z",
  "answers": [
    {
      "q": "what is agar powder",
      "a": "Agar powder (E406) is a plant-derived gelling agent extracted from red algae, used as a vegetarian alternative to gelatin to thicken and stabilize foods.",
      "answeredAt": "2025-10-15T00:48:09.385Z"
    },
    {
      "q": "is annie agar married",
      "a": "This question is unrelated to the food additive E406 (agar); as a food-additive specialist I don’t provide personal information about individuals.",
      "answeredAt": "2025-10-15T00:48:09.385Z"
    },
    {
      "q": "what is agar agar powder",
      "a": "Agar-agar powder is the same as agar (E406): a refined red-seaweed extract that forms firm gels and serves as a thickener, stabiliser, and vegetarian gelatin substitute.",
      "answeredAt": "2025-10-15T00:48:09.385Z"
    },
    {
      "q": "how to make agar plates",
      "a": "Mix ~1.5% w/v agar with appropriate nutrient broth, heat to dissolve, sterilize (e.g., autoclave/pressure cooker), then pour into sterile Petri dishes at about 50°C and allow to set.",
      "answeredAt": "2025-10-15T00:48:09.385Z"
    },
    {
      "q": "is agar agar healthy",
      "a": "Yes—agar (E406) is generally recognized as safe and functions as non-digestible fiber; excessive amounts may cause bloating or a laxative effect, so consume with adequate fluids.",
      "answeredAt": "2025-10-15T00:48:09.385Z"
    },
    {
      "q": "what is ceylon cinnamon",
      "a": "That's a spice; the additive here is E406 (agar), a red-algae-derived gelling and thickening agent used as a vegetarian alternative to gelatin in foods.",
      "answeredAt": "2025-10-12T02:36:30.361Z"
    },
    {
      "q": "how much is a bengal cat",
      "a": "For E406 (agar), typical food-use levels are about 0.2-2% by weight depending on the desired gel strength; regulators set no numerical ADI (not specified) due to low toxicity at normal use.",
      "answeredAt": "2025-10-12T02:36:30.361Z"
    },
    {
      "q": "are bengal cats hypoallergenic",
      "a": "E406 (agar) is generally non-allergenic and suitable for vegetarians and vegans; allergies are rare, though large amounts may cause bloating or a laxative effect.",
      "answeredAt": "2025-10-12T02:36:30.361Z"
    },
    {
      "q": "what is a bengal",
      "a": "E406 (agar) is a polysaccharide from red seaweed that forms firm gels to stabilize and thicken foods, serving as a vegetarian gelatin substitute.",
      "answeredAt": "2025-10-12T02:36:30.361Z"
    },
    {
      "q": "how much are bengal cats",
      "a": "There is no set daily limit for E406 (ADI not specified); in foods it is typically used at about 0.2-1% for thickening and 1-2% for firm gels.",
      "answeredAt": "2025-10-12T02:36:30.361Z"
    }
  ]
}
