{
  "updatedAt": "2025-10-15T01:46:14.230Z",
  "answers": [
    {
      "q": "how are sodium phosphates made",
      "a": "They’re produced by neutralizing food‑grade phosphoric acid with sodium hydroxide, carbonate, or bicarbonate to the desired ratio to yield mono-, di-, or trisodium phosphate, then crystallizing (often as hydrates); condensed polyphosphates are made by dehydrating/condensing orthophosphates at elevated temperatures.",
      "answeredAt": "2025-10-15T01:46:14.230Z"
    },
    {
      "q": "how do saline enema sodium phosphates work",
      "a": "They act as hyperosmotic salts that draw water into the colon, increasing volume and stimulating peristalsis to trigger a bowel movement; improper use can cause fluid and electrolyte imbalances, so they should be used only as directed.",
      "answeredAt": "2025-10-15T01:46:14.230Z"
    },
    {
      "q": "how does sodium aluminate react with phosphates",
      "a": "In water, sodium aluminate hydrolyzes to Al(OH)3, which binds phosphate and precipitates it as insoluble aluminum phosphate (AlPO4), especially near neutral pH—this is the basis for phosphate removal in water treatment.",
      "answeredAt": "2025-10-15T01:46:14.230Z"
    },
    {
      "q": "how many meq of sodium does sodium phosphates have",
      "a": "It depends on the specific salt and hydration: anhydrous NaH2PO4 ≈8.3 mEq Na per gram, Na2HPO4 ≈14.1 mEq/g, and Na3PO4 ≈18.3 mEq/g (hydrates contain less per gram); a typical adult sodium phosphate enema contains about 190 mEq of sodium.",
      "answeredAt": "2025-10-15T01:46:14.230Z"
    },
    {
      "q": "how many sodium phosphates are there",
      "a": "There are three main orthophosphate salts used in foods—monosodium, disodium, and trisodium phosphate—listed as E339(i–iii), plus various hydrates and condensed (polyphosphate) forms.",
      "answeredAt": "2025-10-15T01:46:14.230Z"
    },
    {
      "q": "is sodium phosphate bad for you",
      "a": "No—E339 sodium phosphates are approved and considered safe at permitted levels. Excess intake adds phosphorus and sodium, which can be a concern for people with kidney disease or on phosphate- or sodium-restricted diets.",
      "answeredAt": "2025-10-12T02:40:29.835Z"
    },
    {
      "q": "what is sodium aluminum phosphate",
      "a": "It's a different additive from E339—sodium aluminum phosphate (E541) is a leavening acid and emulsifying salt used in baking powders and processed cheeses to control rise and texture.",
      "answeredAt": "2025-10-12T02:40:29.835Z"
    },
    {
      "q": "is sodium aluminum phosphate bad for you",
      "a": "Generally no—it’s authorized at specified levels and considered safe for most people. It contributes small amounts of aluminum, so total aluminum intake should stay within recommended limits, especially for those with impaired kidney function.",
      "answeredAt": "2025-10-12T02:40:29.835Z"
    },
    {
      "q": "is sodium phosphate a nitrate",
      "a": "No—phosphates are salts of phosphoric acid, whereas nitrates are salts of nitric acid; they are different compounds with different roles in foods.",
      "answeredAt": "2025-10-12T02:40:29.835Z"
    },
    {
      "q": "what is sodium phosphate in food",
      "a": "Sodium phosphates (E339) are sodium salts of phosphoric acid used as emulsifiers, acidity regulators, sequestrants, and moisture/texture enhancers. They’re common in processed meats, cheeses, dairy drinks, and baked goods.",
      "answeredAt": "2025-10-12T02:40:29.835Z"
    }
  ]
}
