{
  "updatedAt": "2025-10-15T01:45:02.744Z",
  "answers": [
    {
      "q": "what is gypsum used for",
      "a": "In foods (E516), gypsum (calcium sulfate) is used as a stabiliser/firming and anti‑caking agent, a tofu coagulant, and to adjust brewing water; outside food it’s used for plaster, drywall, and as a desiccant.",
      "answeredAt": "2025-10-15T01:45:02.744Z"
    },
    {
      "q": "what is gypsum board",
      "a": "Gypsum board (drywall) is a building panel with a calcium sulfate core faced with paper, used for interior walls and ceilings—it's a construction use of the same mineral, not a food application of E516.",
      "answeredAt": "2025-10-15T01:45:02.744Z"
    },
    {
      "q": "what does gypsum do for soil",
      "a": "It supplies calcium and sulfate without notably changing pH, and can improve structure and water infiltration in sodic (sodium-affected) soils by displacing sodium; it has little effect on non‑sodic clays.",
      "answeredAt": "2025-10-15T01:45:02.744Z"
    },
    {
      "q": "what is selenite good for",
      "a": "Selenite is the crystalline mineral form of gypsum (calcium sulfate); it’s used like gypsum in construction materials and as a source of calcium and sulfate, including limited food uses as additive E516.",
      "answeredAt": "2025-10-15T01:45:02.744Z"
    },
    {
      "q": "how much gypsum to add to soil",
      "a": "Apply based on a soil test: typical maintenance rates are about 10–40 lb per 1,000 sq ft (50–200 g/m²) for lawns/gardens, while reclaiming sodic soils can require much more (around 1–4 tons/acre, 2–9 t/ha). Over‑application won’t fix non‑sodic clays and can add unnecessary salts.",
      "answeredAt": "2025-10-15T01:45:02.744Z"
    },
    {
      "q": "how to cleanse selenite",
      "a": "Because selenite (gypsum) is soft and slightly water‑soluble, clean it by gently dusting or a brief wipe with a barely damp cloth, then dry immediately—avoid soaking or harsh cleaners. Keep it away from food surfaces, as only food‑grade calcium sulfate (E516) is intended for contact with foods.",
      "answeredAt": "2025-10-12T02:43:53.422Z"
    }
  ]
}
