{
  "updatedAt": "2025-10-12T02:39:36.600Z",
  "answers": [
    {
      "q": "how can i order canadian cyclamates for the us",
      "a": "In the U.S., cyclamate (E952) isn’t FDA‑approved as a food additive, so importing Canadian cyclamate sweeteners for food use can be refused by customs; check federal and state rules before attempting. If purchasing for permitted non‑food uses, buy from reputable suppliers and verify labeling and intended use—don’t try to circumvent regulations.",
      "answeredAt": "2025-10-12T02:39:36.600Z"
    },
    {
      "q": "how many moles of sodium cyclamate are contained in a 25.6 g sample?",
      "a": "Sodium cyclamate (C6H12NO3SNa) has a molar mass of about 201.2 g/mol, so 25.6 g corresponds to roughly 0.127 moles (25.6 ÷ 201.2 ≈ 0.127).",
      "answeredAt": "2025-10-12T02:39:36.600Z"
    },
    {
      "q": "how much is sodium cyclamate in kano",
      "a": "Prices vary widely by grade, pack size, and supplier; check local ingredient distributors or Nigerian e‑commerce/wholesale markets for current quotes. Ensure it’s food‑grade E952 with a certificate of analysis and that its use complies with NAFDAC regulations.",
      "answeredAt": "2025-10-12T02:39:36.600Z"
    },
    {
      "q": "ordered sugar twin cyclamates from canada how long til it arrives",
      "a": "Cross‑border shipments from Canada to the U.S. often take about 3–10 business days, but customs can add delays. Note that cyclamate sweeteners aren’t FDA‑approved for food use, so shipments may be held or refused at the border.",
      "answeredAt": "2025-10-12T02:39:36.600Z"
    },
    {
      "q": "the truth about cyclamates and why they were banned",
      "a": "The U.S. banned cyclamates in 1970 after high‑dose rat studies (often with cyclamate–saccharin mixtures) suggested a bladder tumor risk and raised concerns about the metabolite cyclohexylamine. Subsequent reviews by bodies such as JECFA set an ADI (e.g., 0–11 mg/kg bw/day) and many countries allow E952 within limits, but the original U.S. ban remains in place.",
      "answeredAt": "2025-10-12T02:39:36.600Z"
    }
  ]
}
