{
  "updatedAt": "2025-10-12T02:36:03.633Z",
  "answers": [
    {
      "q": "is sulfur dioxide bad for you",
      "a": "At high concentrations as a gas, sulfur dioxide is harmful and irritates the eyes and lungs; in foods at regulated levels (E220) it’s considered safe for most people. Some individuals—especially those with asthma or sulfite sensitivity—may experience reactions such as wheezing, hives, or stomach upset.",
      "answeredAt": "2025-10-12T02:36:03.633Z"
    },
    {
      "q": "is sulfur dioxide in food bad for you",
      "a": "Within legal limits, sulfites (including SO2, E220) are approved preservatives and generally safe for the general population. They must be declared at ≥10 mg/kg or L, and sensitive individuals can react; most people stay below the accepted daily intake (about 0–0.7 mg/kg body weight), though heavy consumers of sulfited foods may approach or exceed it.",
      "answeredAt": "2025-10-12T02:36:03.633Z"
    },
    {
      "q": "what is sulfur dioxide used for",
      "a": "It’s an antioxidant and preservative that prevents browning and inhibits microbes to extend shelf life. Common uses include wines, ciders, dried fruits, fruit juices, and some pickled or processed foods.",
      "answeredAt": "2025-10-12T02:36:03.633Z"
    },
    {
      "q": "where does sulfur dioxide come from",
      "a": "Food-grade sulfur dioxide is produced industrially by burning sulfur or processing sulfur‑containing ores, and small amounts can also form during fermentation. It also occurs naturally from volcanic emissions, but the additive used in foods is manufactured and added in controlled amounts.",
      "answeredAt": "2025-10-12T02:36:03.633Z"
    },
    {
      "q": "is sulfur dioxide in dried fruit bad for you",
      "a": "It preserves color and prevents spoilage in dried fruit and is considered safe at permitted levels, but can trigger reactions in sulfite‑sensitive people, especially some asthmatics. If you’re sensitive, choose “unsulphured” dried fruit; rinsing may reduce surface residues but won’t remove all sulfites.",
      "answeredAt": "2025-10-12T02:36:03.633Z"
    }
  ]
}
