{
  "updatedAt": "2025-10-15T00:49:59.398Z",
  "answers": [
    {
      "q": "what is pullulan capsule",
      "a": "A pullulan capsule is a plant-based, gelatin-free capsule shell made from pullulan (E1204), a polysaccharide produced by fermenting starch with the fungus Aureobasidium pullulans; it’s clear, tasteless, and has very low oxygen permeability to help protect sensitive ingredients.",
      "answeredAt": "2025-10-15T00:49:59.398Z"
    },
    {
      "q": "pullulan what is it",
      "a": "Pullulan (E1204) is a polysaccharide made by fermenting starch with Aureobasidium pullulans, used in foods and supplements as a film-former and thickener, including for edible films and capsule shells.",
      "answeredAt": "2025-10-15T00:49:59.398Z"
    },
    {
      "q": "what are pullulan capsules made of",
      "a": "Primarily pullulan polymer derived from fermented starch, plus water; manufacturers often add small amounts of gelling agents (such as gellan gum) and plasticizers like glycerin or sorbitol to form the shell.",
      "answeredAt": "2025-10-15T00:49:59.398Z"
    },
    {
      "q": "what is organic pullulan",
      "a": "Organic pullulan is pullulan produced via fermentation using organic-certified substrates and processes that meet organic standards (e.g., USDA/EU) and is used to make organic-labeled edible films and capsule shells.",
      "answeredAt": "2025-10-15T00:49:59.398Z"
    },
    {
      "q": "what is a pullulan capsule",
      "a": "A pullulan capsule is a vegetarian capsule shell made from pullulan (E1204) instead of animal gelatin, offering a clear, tasteless shell with strong oxygen-barrier properties for supplements.",
      "answeredAt": "2025-10-15T00:49:59.398Z"
    },
    {
      "q": "what is a linear function",
      "a": "For E1204 Pullulan, “linear” describes its mostly linear polymer chain—maltotriose units linked α‑1,6 with internal α‑1,4—while its function in foods is as a film-former and thickener, not a mathematical function.",
      "answeredAt": "2025-10-12T02:42:17.567Z"
    },
    {
      "q": "what is a linear foot",
      "a": "A linear foot is a length measure and isn’t relevant to E1204; pullulan is supplied and used by weight for its film-forming and thickening properties.",
      "answeredAt": "2025-10-12T02:42:17.567Z"
    },
    {
      "q": "which table represents a linear function?",
      "a": "That math question doesn’t apply to E1204; for pullulan, you’d consult technical data sheets showing composition, molecular weight, and viscosity versus concentration.",
      "answeredAt": "2025-10-12T02:42:17.567Z"
    },
    {
      "q": "what is a linear equation",
      "a": "In the context of pullulan, “linear” refers to the polymer’s chain architecture, not an equation; E1204 is a film-forming, thickening polysaccharide used in edible films and coatings.",
      "answeredAt": "2025-10-12T02:42:17.567Z"
    },
    {
      "q": "what is linear regression",
      "a": "Linear regression is a statistical method and doesn’t pertain to E1204; for pullulan the relevant information is its role as a film-former and thickener used in edible films, capsules, and coatings.",
      "answeredAt": "2025-10-12T02:42:17.567Z"
    }
  ]
}
