{
  "updatedAt": "2025-10-12T02:47:29.693Z",
  "answers": [
    {
      "q": "what is mannitol used for",
      "a": "In foods, E421 mannitol is used as a low‑calorie sweetener, bulking agent, and humectant/stabilizer (common in sugar‑free gum, candies, and baked goods); it’s also a pharmaceutical excipient. Medically, IV mannitol is an osmotic diuretic to reduce intracranial and intraocular pressure and promote diuresis.",
      "answeredAt": "2025-10-12T02:47:29.693Z"
    },
    {
      "q": "how mannitol works",
      "a": "As a food ingredient, it’s poorly absorbed so it provides fewer calories and a low glycemic response, with a mild cooling taste. As a medicine, it acts osmotically—filtered by the kidneys and minimally reabsorbed—raising plasma and tubular fluid osmolality to draw water from tissues and increase urine output, lowering brain/eye pressure.",
      "answeredAt": "2025-10-12T02:47:29.693Z"
    },
    {
      "q": "how does mannitol work",
      "a": "It works osmotically when given IV, increasing blood and renal filtrate osmolality so water moves from tissues into the circulation and then into urine, reducing intracranial and intraocular pressure. In foods, its limited absorption yields a lower-calorie, low‑glycemic sweetening effect.",
      "answeredAt": "2025-10-12T02:47:29.693Z"
    },
    {
      "q": "is mannitol safe for dogs",
      "a": "Mannitol isn’t known to be acutely toxic to dogs like xylitol, but ingestion can cause diarrhea and gas, and large amounts may lead to dehydration or electrolyte imbalances. Therapeutic IV mannitol should only be used by a veterinarian; consult your vet especially for dogs with kidney or heart disease.",
      "answeredAt": "2025-10-12T02:47:29.693Z"
    },
    {
      "q": "is mannitol salt agar selective or differential",
      "a": "Both: the high salt concentration makes it selective for staphylococci, and mannitol with phenol red makes it differential by turning yellow when mannitol‑fermenting organisms (e.g., many S. aureus) produce acid.",
      "answeredAt": "2025-10-12T02:47:29.693Z"
    }
  ]
}
