{
  "updatedAt": "2025-10-15T02:00:00.000Z",
  "answers": [
    {
      "q": "what is titanium dioxide",
      "a": "Titanium dioxide (E171) is a bright white mineral pigment (TiO2) that gives foods and coatings strong opacity and whiteness. It is mined from ores such as ilmenite or rutile and then purified for use in products like confectionery, gums, bakery icings, and supplement coatings.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide safe",
      "a": "As a food color (E171), the EU no longer considers it safe and banned food uses in 2022 because potential genotoxicity of nano-sized particles could not be ruled out. Regulators in the U.S., UK, and several other regions still permit it within strict limits.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide bad for you",
      "a": "Typical dietary exposure shows low acute toxicity, but ongoing uncertainty about DNA damage from very small particles led the EU to ban it in foods as a precaution. Occupational inhalation of TiO2 dust—not eating it—is the scenario most closely linked to cancer risk (IARC Group 2B).",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide safe in sunscreen",
      "a": "Yes—titanium dioxide is widely accepted as a safe, effective mineral UV filter in sunscreens when applied to skin. The main caution is avoiding inhalation of sprays or loose powders, since respiratory exposure to fine TiO2 particles is the concern flagged by IARC.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "what is titanium dioxide used for",
      "a": "In foods it serves as a whitening and opacifying agent in candies, chewing gum, bakery decorations, sauces, and supplement coatings. Outside food it is used heavily in paints, plastics, paper, cosmetics, and sunscreens for its brightness and UV-scattering properties.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "what does titanium dioxide do",
      "a": "It scatters light to create a vivid white appearance and hides underlying colors or textures, giving foods and tablets a uniform look. In personal care products it blocks and reflects UV light, contributing to SPF protection in mineral sunscreens.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide safe for skin",
      "a": "Topical use in creams or lotions is generally considered safe; TiO2 sits on the skin surface and is approved as a UV filter by regulators such as the FDA and EU. Again, avoid inhaling powders or sprays where particles can reach the lungs.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "does titanium dioxide cause cancer",
      "a": "Inhalation of airborne TiO2 dust at high levels is classified by IARC as “possibly carcinogenic” (Group 2B) based on animal studies. That classification does not address food use; oral exposure from E171 has not been directly linked to cancer, though the EU banned it over unresolved genotoxicity concerns.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide safe in makeup",
      "a": "Pressed or cream cosmetics that use TiO2 for coverage or sun protection are generally regarded as safe. Use caution with loose powders or aerosols to minimize inhalation, and follow any warnings provided by the manufacturer.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    },
    {
      "q": "is titanium dioxide safe to eat",
      "a": "Regulators differ: the EU removed E171 from approved food additives in 2022, while the U.S., UK, Canada, and others still allow it when purity and use-level limits are met. Available data show minimal absorption, but some toxicologists remain concerned about long-term nanoparticle effects.",
      "answeredAt": "2025-10-15T02:00:00.000Z"
    }
  ]
}
