{
  "updatedAt": "2025-10-12T02:31:11.392Z",
  "answers": [
    {
      "q": "how much konjac gum to use",
      "a": "Typical food-use levels are about 0.1–1.0% by weight for thickening/stabilising; 0.2–0.6% (often with xanthan or carrageenan) for elastic gels; and roughly 1–3% for firm konjac gels/noodles when used with alkali/calcium—adjust to the desired texture and local regulations.",
      "answeredAt": "2025-10-12T02:31:11.392Z"
    },
    {
      "q": "how much pure konjac gum should you take at one time in powder form",
      "a": "Do not swallow dry konjac gum powder—it swells rapidly and can cause choking or blockage; it is intended to be fully hydrated in foods. If using glucomannan supplements, follow the product’s directions (single doses are commonly around 1 g with plenty of water), but this refers to E425(ii), not E425(i) gum.",
      "answeredAt": "2025-10-12T02:31:11.392Z"
    },
    {
      "q": "how to use konjac gum",
      "a": "Premix the powder with sugar or oil (or other dry ingredients) to prevent clumping, then hydrate with good agitation—often in hot water (about 60–90°C) until fully dispersed. For firm, heat-stable gels, use a small amount of alkali or calcium; konjac works synergistically with xanthan or kappa-carrageenan to build elastic texture.",
      "answeredAt": "2025-10-12T02:31:11.392Z"
    },
    {
      "q": "what is konjac gum xanthan gum used for",
      "a": "Together they are used to make stable, elastic, shear-thinning textures in sauces, dressings, plant-based meats, dairy alternatives, and gluten-free doughs, and to form heat-stable gels. The blend improves suspension and freeze–thaw stability compared with either gum alone.",
      "answeredAt": "2025-10-12T02:31:11.392Z"
    },
    {
      "q": "what is konjac root gum",
      "a": "Konjac root gum (E425i) is a plant-derived hydrocolloid from the tuber of Amorphophallus konjac, composed mainly of glucomannan, used as a thickener, stabiliser, emulsifier, humectant, and carrier in foods.",
      "answeredAt": "2025-10-12T02:31:11.392Z"
    }
  ]
}
