{
  "updatedAt": "2025-10-15T01:45:44.842Z",
  "answers": [
    {
      "q": "what is magnesium oxide good for",
      "a": "In foods, E530 is good for keeping powders free‑flowing (anti‑caking) and helping control acidity/alkalinity (pH); it may also serve as a source of magnesium in fortification.",
      "answeredAt": "2025-10-15T01:45:44.842Z"
    },
    {
      "q": "what is magnesium oxide used for",
      "a": "As a food additive it’s used in products like table salt, spices, cocoa, and drink or baking mixes to prevent clumping and to adjust pH; it can also supply magnesium in some fortified foods.",
      "answeredAt": "2025-10-15T01:45:44.842Z"
    },
    {
      "q": "what is magnesium oxide 400 mg used for",
      "a": "That tablet dose is a dietary supplement, not a food‑additive use; 400 mg MgO provides about 240 mg elemental magnesium and is used to address low magnesium or as an antacid/laxative, though it’s relatively poorly absorbed and can cause diarrhea at high doses.",
      "answeredAt": "2025-10-15T01:45:44.842Z"
    },
    {
      "q": "is magnesium oxide good for you",
      "a": "At the small amounts used in foods, it’s considered safe (permitted in the EU as E530 and GRAS in the U.S.); as a supplement it can help correct deficiency but has lower bioavailability than some forms and high doses may upset the stomach or cause diarrhea.",
      "answeredAt": "2025-10-15T01:45:44.842Z"
    },
    {
      "q": "what does magnesium oxide do",
      "a": "In foods it prevents caking and helps stabilize pH, and can contribute magnesium for fortification.",
      "answeredAt": "2025-10-15T01:45:44.842Z"
    },
    {
      "q": "what is milk of magnesia",
      "a": "Milk of magnesia is a suspension of magnesium hydroxide (which forms when magnesium oxide reacts with water), commonly used as an antacid and osmotic laxative.",
      "answeredAt": "2025-10-12T02:43:03.542Z"
    },
    {
      "q": "what is milk of magnesia used for",
      "a": "It’s used to neutralize stomach acid for heartburn/indigestion relief and as an osmotic laxative for occasional constipation.",
      "answeredAt": "2025-10-12T02:43:03.542Z"
    },
    {
      "q": "how long does milk of magnesia take to wear off",
      "a": "As a laxative, it typically produces a bowel movement within 30 minutes to 6 hours and the effect resolves within about a day; antacid relief usually lasts 30 minutes to a few hours depending on stomach contents.",
      "answeredAt": "2025-10-12T02:43:03.542Z"
    }
  ]
}
