{
  "updatedAt": "2025-10-15T00:49:27.866Z",
  "answers": [
    {
      "q": "3 acetic acid with methylene blue how much methylene blue",
      "a": "Methylene blue is not E131—E131 is Patent Blue V; for E131, use the minimum needed to achieve color and stay within the maximum levels allowed by your local food regulations.",
      "answeredAt": "2025-10-15T00:49:27.866Z"
    },
    {
      "q": "e131 baxi how to fix",
      "a": "E131 on food labels refers to Patent Blue V, a blue color additive, and is unrelated to Baxi boiler fault codes; its food use is permitted only in certain jurisdictions (not FDA‑approved in the U.S.).",
      "answeredAt": "2025-10-15T00:49:27.866Z"
    },
    {
      "q": "how many universes e131",
      "a": "E131 is simply the code for the blue food color Patent Blue V; it has no connection to “universes.”",
      "answeredAt": "2025-10-15T00:49:27.866Z"
    },
    {
      "q": "how much food does a 5 year old female blue heeler suposed to eat",
      "a": "That isn’t about E131; Patent Blue V is a synthetic blue dye used at very low levels to color foods, with permitted uses varying by country.",
      "answeredAt": "2025-10-15T00:49:27.866Z"
    },
    {
      "q": "how much food does a 5 year old female blue heeler supposed to eat",
      "a": "Feeding advice for dogs isn’t related to E131; Patent Blue V is a blue food coloring used in tiny amounts where permitted, and it’s not approved in the U.S.",
      "answeredAt": "2025-10-15T00:49:27.866Z"
    },
    {
      "q": "why is the sky blue",
      "a": "Unrelated: Patent Blue V (E131) is a synthetic triphenylmethane blue dye used to color foods; it’s permitted with restrictions in the EU but not approved for use in U.S. foods.",
      "answeredAt": "2025-10-12T02:43:49.873Z"
    },
    {
      "q": "why is the sky blue?",
      "a": "Unrelated: Patent Blue V (E131) is a synthetic triphenylmethane blue dye used to color foods; it’s permitted with restrictions in the EU but not approved for use in U.S. foods.",
      "answeredAt": "2025-10-12T02:43:49.873Z"
    },
    {
      "q": "what is blue sky",
      "a": "In food additives, Sky Blue is a synonym for Patent Blue V (E131), a synthetic dye used to give foods a vivid blue color.",
      "answeredAt": "2025-10-12T02:43:49.873Z"
    },
    {
      "q": "who owns blue sky",
      "a": "No one owns Patent Blue V (E131); it’s a generic color additive produced by multiple manufacturers and regulated by authorities in each country.",
      "answeredAt": "2025-10-12T02:43:49.873Z"
    },
    {
      "q": "what is blue sky social media",
      "a": "Unrelated to E131: Patent Blue V (also called Sky Blue) is a synthetic food colorant and has no connection to social media platforms.",
      "answeredAt": "2025-10-12T02:43:49.873Z"
    }
  ]
}
