{
  "updatedAt": "2025-10-12T02:37:58.632Z",
  "answers": [
    {
      "q": "what breads have azodicarbonamide",
      "a": "In countries where it's permitted (e.g., the U.S.), some mass-produced white and wheat sandwich breads, hamburger/hot dog buns, and bagels may contain azodicarbonamide as a dough conditioner; check the ingredient list for \"azodicarbonamide\" or \"ADA\".",
      "answeredAt": "2025-10-12T02:37:58.632Z"
    },
    {
      "q": "what is azodicarbonamide used for",
      "a": "In foods, azodicarbonamide (E927a) is a flour treatment agent/oxidizing dough conditioner that strengthens dough, improves rise and crumb, and can slightly bleach flour. Outside food, it's used as a blowing agent to make foamed plastics and rubber.",
      "answeredAt": "2025-10-12T02:37:58.632Z"
    },
    {
      "q": "what does azodicarbonamide do to your body",
      "a": "At permitted food levels it breaks down during dough processing and baking and is not expected to have direct health effects for consumers, and regulators like the FDA allow it within limits. Occupational inhalation of the raw powder can irritate or sensitize the respiratory tract, and concerns about breakdown products have led some regions (e.g., EU, Australia/New Zealand, Singapore) to prohibit its use in food.",
      "answeredAt": "2025-10-12T02:37:58.632Z"
    },
    {
      "q": "what foods contain azodicarbonamide",
      "a": "Primarily some commercially baked goods such as sliced sandwich breads, hamburger and hot dog buns, bagels, flour tortillas, and frozen or par-baked doughs in countries where allowed. Check labels for \"azodicarbonamide\" or \"ADA,\" as many brands have reformulated to remove it.",
      "answeredAt": "2025-10-12T02:37:58.632Z"
    },
    {
      "q": "what products contain azodicarbonamide",
      "a": "Food products that may contain it include certain mass-produced breads, buns, bagels, tortillas, and frozen or par-baked doughs (where permitted). Non-food uses include foamed plastics and rubber products like shoe soles and yoga mats, where it acts as a blowing agent.",
      "answeredAt": "2025-10-12T02:37:58.632Z"
    }
  ]
}
