{
  "updatedAt": "2025-10-15T00:49:18.552Z",
  "answers": [
    {
      "q": "is msg bad for you",
      "a": "No—MSG (E621) is generally recognized as safe by the FDA and permitted in the EU within limits; most people don’t experience adverse effects at typical food levels. A small subset may have short-lived symptoms (like headache or flushing) after large bolus intakes, and it contributes some sodium.",
      "answeredAt": "2025-10-12T02:34:38.338Z"
    },
    {
      "q": "what is msg in food",
      "a": "MSG is monosodium glutamate, the sodium salt of the amino acid glutamic acid, used as a flavor enhancer to add umami and intensify savory taste. It’s the same form of glutamate found naturally in foods like tomatoes and cheese.",
      "answeredAt": "2025-10-12T02:34:38.338Z"
    },
    {
      "q": "what is msg made of",
      "a": "It’s the sodium salt of L-glutamic acid, typically produced by fermenting plant sugars (e.g., sugarcane, sugar beet, or corn starch) with microbes, then neutralizing the glutamic acid with sodium. The result is purified crystals of monosodium glutamate.",
      "answeredAt": "2025-10-12T02:34:38.338Z"
    },
    {
      "q": "why is msg bad for you",
      "a": "It isn’t considered “bad” at normal intakes—regulators deem it safe, and EFSA set a group ADI for glutamates of 30 mg/kg body weight/day to limit high exposures. Some people may experience transient symptoms after large doses, and it can add to overall sodium intake if overused.",
      "answeredAt": "2025-10-12T02:34:38.338Z"
    },
    {
      "q": "is msg bad",
      "a": "No—MSG (E621) is considered safe at normal food levels (FDA GRAS; EFSA sets an acceptable daily intake of 30 mg/kg body weight/day), and well-controlled studies haven’t shown consistent harms. A small subset of people may get brief symptoms like headache or flushing after large doses, especially on an empty stomach, and it does add some sodium, but typical culinary use is fine for most.",
      "answeredAt": "2025-10-15T00:49:18.552Z"
    },
    {
      "q": "what does msg do",
      "a": "It enhances umami, balancing and intensifying savory flavors so foods taste richer and more rounded. It can also help maintain flavor while allowing some reduction in added salt.",
      "answeredAt": "2025-10-12T02:34:38.338Z"
    }
  ]
}
