{
  "updatedAt": "2025-10-12T02:40:27.864Z",
  "answers": [
    {
      "q": "what is tetrapotassium pyrophosphate used for",
      "a": "It’s used in foods as a sequestrant, stabilizer, and emulsifying salt to bind minerals, control pH, and improve water-holding and texture (e.g., in processed meats/seafood and processed cheese). It’s also used in toothpaste as an anti-tartar agent.",
      "answeredAt": "2025-10-12T02:40:27.864Z"
    },
    {
      "q": "what are the chemical properties of tetrapotassium pyrophosphate",
      "a": "It’s an inorganic salt (K4P2O7) with the pyrophosphate anion; a white, water‑soluble powder that forms alkaline solutions (about pH 10) and strongly chelates calcium and magnesium. It buffers pH, disperses proteins, and can hydrolyze to orthophosphate under acidic conditions or enzymatic action.",
      "answeredAt": "2025-10-12T02:40:27.864Z"
    },
    {
      "q": "what are the dangers of tetrapotassium 1 - 10 pyrophosphate",
      "a": "Within permitted food levels, phosphates including tetrapotassium pyrophosphate are considered safe; excessive phosphate or potassium intake may disrupt mineral balance and is a concern for people with kidney disease or on potassium‑restricted diets. Dust or concentrated solutions can irritate eyes, skin, and the respiratory tract due to alkalinity.",
      "answeredAt": "2025-10-12T02:40:27.864Z"
    },
    {
      "q": "what are the dangers of tetrapotassium pyrophosphate",
      "a": "At approved food-use levels it’s considered safe (phosphates have a group ADI from EFSA); high intakes of phosphates or potassium can affect calcium balance or pose risks for those with kidney disease or hyperkalemia. As a powder/solution it may cause eye, skin, or respiratory irritation.",
      "answeredAt": "2025-10-12T02:40:27.864Z"
    },
    {
      "q": "what is tetrapotassium pyrophosphate in toothpaste",
      "a": "It’s a tartar-control agent that chelates calcium to inhibit plaque from hardening into calculus, and it helps keep stains dispersed. It also contributes to pH control in the formulation.",
      "answeredAt": "2025-10-12T02:40:27.864Z"
    }
  ]
}
