{
  "updatedAt": "2025-10-15T01:45:02.740Z",
  "answers": [
    {
      "q": "is orthoboric acid the same as boric acid",
      "a": "Yes—orthoboric acid (also called boracic acid) is the same compound as boric acid (H3BO3), designated as E284.",
      "answeredAt": "2025-10-15T01:45:02.740Z"
    },
    {
      "q": "how does orthoboric acid poison work on insects",
      "a": "It acts as a slow-acting stomach poison and desiccant: ingested boric acid disrupts the insect gut and enzyme function, and contact can damage the exoskeleton, leading to dehydration and death.",
      "answeredAt": "2025-10-15T01:45:02.740Z"
    },
    {
      "q": "how does orthoboric acid work",
      "a": "As a food additive (E284), it functions as a preservative by inhibiting microbial growth in certain tightly restricted uses (e.g., caviar in some regions). Outside food, it serves as a mild antiseptic and a slow-acting insecticidal desiccant/stomach poison.",
      "answeredAt": "2025-10-15T01:45:02.740Z"
    },
    {
      "q": "how long does orthoboric acid kill ants",
      "a": "After ingesting bait, individual ants typically die within 24–48 hours; noticeable colony reduction often appears in 3–7 days, with full control taking 1–3 weeks depending on species and bait formulation.",
      "answeredAt": "2025-10-15T01:45:02.740Z"
    },
    {
      "q": "how much orthoboric acid must be ingested to be harmful?",
      "a": "Acute harm generally requires gram-level doses; case reports suggest about 15–20 g may be potentially lethal for adults (with much lower amounts posing serious risk to children). For long-term exposure, a commonly cited upper level for boron is 10 mg/day (≈57 mg/day as boric acid) for adults.",
      "answeredAt": "2025-10-15T01:45:02.740Z"
    },
    {
      "q": "is boric acid safe for vaginas",
      "a": "Vaginal boric acid suppositories are generally considered safe for short-term use in non-pregnant adults when used as directed, though they can cause burning or irritation; do not ingest and avoid use during pregnancy.",
      "answeredAt": "2025-10-12T02:45:27.071Z"
    },
    {
      "q": "does boric acid help bv",
      "a": "It may help with recurrent bacterial vaginosis as an adjunct to standard antibiotics by restoring acidic pH and disrupting biofilms, but it isn’t first-line therapy and should be used under clinician guidance.",
      "answeredAt": "2025-10-12T02:45:27.071Z"
    },
    {
      "q": "what does boric acid do",
      "a": "As a food additive (E284), it inhibits microbial growth as a preservative (now largely prohibited in many regions); medically, it has antiseptic/antifungal effects and can acidify the vagina when used as suppositories.",
      "answeredAt": "2025-10-12T02:45:27.071Z"
    },
    {
      "q": "what is boric acid used for",
      "a": "Historically in foods it was used as a preservative (e.g., caviar) but is now restricted or banned in many jurisdictions; outside food it’s used as an antiseptic, insecticide, flame retardant, and in gynecology for recurrent yeast infections or BV.",
      "answeredAt": "2025-10-12T02:45:27.071Z"
    },
    {
      "q": "does boric acid make you tighter",
      "a": "No—boric acid does not tighten the vagina; it may reduce odor and discharge by addressing infection and pH, but it doesn’t change tissue elasticity.",
      "answeredAt": "2025-10-12T02:45:27.071Z"
    }
  ]
}
