{
  "updatedAt": "2025-10-12T02:40:49.195Z",
  "answers": [
    {
      "q": "what is sodium acid pyrophosphate",
      "a": "You may be thinking of sodium acid pyrophosphate (SAPP, E450i), but this entry covers tetrasodium diphosphate (E450iii), an inorganic phosphate salt used as a sequestrant, stabiliser/emulsifier, humectant and thickener. It helps bind metal ions, control pH and retain moisture in foods like processed meats and seafood.",
      "answeredAt": "2025-10-12T02:40:49.195Z"
    },
    {
      "q": "is sodium acid pyrophosphate bad for you",
      "a": "At permitted food levels, tetrasodium diphosphate (E450iii)—a related phosphate—is considered safe by major regulators; EFSA sets a group ADI for phosphates of 40 mg/kg body weight/day (as phosphorus). Very high phosphate or sodium intakes can be a concern for people with kidney disease or on phosphate‑restricted diets.",
      "answeredAt": "2025-10-12T02:40:49.195Z"
    },
    {
      "q": "is sodium acid pyrophosphate gluten free",
      "a": "Yes—tetrasodium diphosphate (E450iii) is an inorganic mineral salt and is gluten‑free. As with any ingredient, gluten risk would only come from cross‑contact during manufacturing, not the additive itself.",
      "answeredAt": "2025-10-12T02:40:49.195Z"
    },
    {
      "q": "is tetrasodium pyrophosphate safe",
      "a": "Yes—when used within legal limits, tetrasodium diphosphate (E450iii) is permitted and considered safe by regulators (e.g., FDA, EFSA/JECFA), with EFSA’s group ADI for phosphates at 40 mg/kg body weight/day (as phosphorus). People with kidney disease or needing to limit phosphate/sodium should moderate intake.",
      "answeredAt": "2025-10-12T02:40:49.195Z"
    },
    {
      "q": "is sodium acid pyrophosphate safe",
      "a": "While you mention SAPP, for the related tetrasodium diphosphate (E450iii) the consensus is that it’s safe at approved levels, under the same phosphate group ADI set by EFSA (40 mg/kg body weight/day as phosphorus). Those with kidney issues or on phosphate‑restricted diets should limit exposure.",
      "answeredAt": "2025-10-12T02:40:49.195Z"
    }
  ]
}
