{
  "updatedAt": "2025-10-12T02:30:41.053Z",
  "answers": [
    {
      "q": "how can a petroleum-based curl wax not hurt your paint on your car",
      "a": "Microcrystalline petroleum wax (E905c) is chemically inert and non‑solvent, so it typically won’t attack fully cured automotive paint; any risk comes from other ingredients (e.g., solvents or dyes) in the curl product. Wipe off promptly and spot‑test in an inconspicuous area.",
      "answeredAt": "2025-10-12T02:30:41.053Z"
    },
    {
      "q": "how do you put petroleum jelly and wax on cotton balls",
      "a": "Gently melt microcrystalline wax (E905c) in a double boiler, soften the petroleum jelly, then knead a small amount into the cotton until the fibers are lightly coated and let it cool to set. Avoid overheating and open flames.",
      "answeredAt": "2025-10-12T02:30:41.053Z"
    },
    {
      "q": "how to deal with petroleum smell of jubilee wax",
      "a": "The odor is from residual light hydrocarbons; apply very thin coats, allow thorough curing with good ventilation, and the smell will dissipate. Choosing fully refined, food‑grade microcrystalline wax (E905c) products can reduce odor.",
      "answeredAt": "2025-10-12T02:30:41.053Z"
    },
    {
      "q": "how to make non petroleum jelly using castor wax",
      "a": "Make a petroleum‑free gel by melting hydrogenated castor oil (castor wax) into a neutral plant oil at about 1:3–1:4 by weight, then cool to set; add a little candelilla or beeswax if you need it firmer. This avoids petroleum‑derived E905c entirely.",
      "answeredAt": "2025-10-12T02:30:41.053Z"
    },
    {
      "q": "how to make petroleum wax",
      "a": "E905c microcrystalline wax is produced industrially by de‑oiling petrolatum from lubricating‑oil refining and then further refining (e.g., filtration or hydrotreating) to meet purity specs. It isn’t practical to make at home—purchase certified food‑grade material instead.",
      "answeredAt": "2025-10-12T02:30:41.053Z"
    }
  ]
}
