{
  "updatedAt": "2025-10-15T01:46:16.681Z",
  "answers": [
    {
      "q": "e171 food additive in what foods",
      "a": "It’s a bright-white colorant used to make products look opaque, commonly in candies and chewing gum, icings/frostings, sprinkles, powdered donuts, sauces/dressings, and some dairy or plant-based items; it’s also used on some supplement and pill coatings. Note: its use in foods is banned in the EU (since 2022) but allowed in several other countries.",
      "answeredAt": "2025-10-15T01:46:16.681Z"
    },
    {
      "q": "what are the consequences of e171",
      "a": "Orally, titanium dioxide is poorly absorbed and shows low acute toxicity, but concern focuses on potential genotoxicity from nano-sized particles. EFSA (2021) concluded E171 could no longer be considered safe, prompting an EU food ban, while regulators in the US, UK and others still permit it within limits.",
      "answeredAt": "2025-10-15T01:46:16.681Z"
    },
    {
      "q": "what colour is e171",
      "a": "Bright white; it’s used to provide high whiteness and opacity.",
      "answeredAt": "2025-10-15T01:46:16.681Z"
    },
    {
      "q": "what foods contain e171",
      "a": "Typical examples include candies, chewing gum, mints, frostings/icing, sprinkles, bakery goods (e.g., powdered donuts), sauces and dressings, and some dairy or plant-based alternatives; it also appears on some supplement/capsule coatings. In the EU, foods should not contain it due to a 2022 ban.",
      "answeredAt": "2025-10-15T01:46:16.681Z"
    },
    {
      "q": "what foods have e171",
      "a": "Most often sweets and confectionery (candy shells, gummies, gum), plus bakery decorations, white sauces, drink mixes, and some processed dairy, though availability depends on country because rules differ.",
      "answeredAt": "2025-10-15T01:46:16.681Z"
    },
    {
      "q": "is titanium dioxide safe",
      "a": "As a food color (E171), the EU no longer considers it safe and banned its use in foods in 2022 due to unresolved genotoxicity concerns. The U.S., UK and several other jurisdictions still permit it within limits.",
      "answeredAt": "2025-10-12T02:42:15.617Z"
    },
    {
      "q": "is titanium dioxide bad for you",
      "a": "At typical dietary levels it has low acute toxicity, but possible DNA damage from small particles can’t be ruled out, which led the EU to ban it in foods as a precaution. Separately, inhaling titanium dioxide dust (not from food) is a respiratory hazard and is classified by IARC as possibly carcinogenic.",
      "answeredAt": "2025-10-12T02:42:15.617Z"
    },
    {
      "q": "is titanium dioxide safe in sunscreen",
      "a": "Yes—titanium dioxide is generally considered safe and effective as a mineral UV filter on skin and is allowed by major regulators (e.g., EU, FDA). Avoid inhaling sprays or powders containing TiO2, as inhalation—not skin application—is the main safety concern.",
      "answeredAt": "2025-10-12T02:42:15.617Z"
    },
    {
      "q": "what is titanium dioxide used for",
      "a": "In foods, E171 is used as a white colorant and opacifier to brighten and whiten products such as confectionery, chewing gum, bakery coatings, sauces, and supplements. It’s also widely used outside food in sunscreens, cosmetics, and paints.",
      "answeredAt": "2025-10-12T02:42:15.617Z"
    },
    {
      "q": "what does titanium dioxide do",
      "a": "In foods, it provides a bright white color and opacity, masking underlying colors and giving a uniform appearance. In sunscreens, it reflects and scatters UV light to help protect skin.",
      "answeredAt": "2025-10-12T02:42:15.617Z"
    }
  ]
}
