{
  "updatedAt": "2025-10-12T02:50:15.260Z",
  "answers": [
    {
      "q": "how to make popping boba without sodium alginate",
      "a": "True popping boba relies on sodium alginate/calcium spherification; without it, you can make similar beads using agar or gelatin (e.g., drip 0.8–1% agar-juice into very cold oil), but they won’t have a liquid center. Some use low‑methoxyl pectin with calcium to create thin skins, but results are less consistent than with alginate.",
      "answeredAt": "2025-10-12T02:50:15.260Z"
    },
    {
      "q": "is sodium alginate bad for you",
      "a": "No—food‑grade sodium alginate is widely approved (e.g., FDA GRAS, EFSA) and is considered safe at typical food levels because it’s poorly absorbed. Large supplemental amounts may cause gas or affect mineral absorption in some people, and those on strict low‑sodium plans should check labels.",
      "answeredAt": "2025-10-12T02:50:15.260Z"
    },
    {
      "q": "what is sodium alginate used for",
      "a": "It’s a seaweed‑derived thickener, stabilizer, and gelling agent that forms gels with calcium—used for spherification, suspending particles in beverages, and improving texture in sauces, dairy, and desserts. It’s also used in some reflux products to form a protective “raft.”",
      "answeredAt": "2025-10-12T02:50:15.260Z"
    },
    {
      "q": "how to use sodium alginate for reflux",
      "a": "Alginate reflux remedies combine alginate with antacids to form a foamy “raft” on stomach contents; use an approved OTC product and follow its label (typically after meals and at bedtime). DIY use of food‑grade sodium alginate for reflux isn’t recommended—ask a pharmacist or clinician for suitable products.",
      "answeredAt": "2025-10-12T02:50:15.260Z"
    },
    {
      "q": "how to make sodium alginate",
      "a": "Commercial sodium alginate is produced from brown seaweeds via alkaline extraction of alginic acid, filtration, precipitation, conversion to the sodium salt, then drying and milling. It isn’t practical to make food‑grade sodium alginate at home; purchase certified food‑grade material instead.",
      "answeredAt": "2025-10-12T02:50:15.260Z"
    }
  ]
}
