{
  "overview": "Discover the roles food additives play across the industry. Each function below includes a short definition and the number of additives that use it.",
  "functions": [
  {
    "name": "Acidity regulator",
    "description": "Acidity regulators are substances which alter or control the acidity or alkalinity of a foodstuff.",
    "usedAs": [
      "acid",
      "acidifier",
      "acidity regulator",
      "alkali",
      "base",
      "buffer",
      "buffering agent",
      "pH adjusting agent"
    ]
  },
  {
    "name": "Anticaking agent",
    "description": "Anti-caking agents are substances which reduce the tendency of individual particles of a foodstuff to adhere to one another.",
    "usedAs": [
      "anticaking agent",
      "anti-stick agent",
      "drying agent",
      "dusting agent"
    ]
  },
  {
    "name": "Antifoaming agent",
    "description": "Anti-foaming agents are substances which prevent or reduce foaming.",
    "usedAs": [
      "antifoaming agent",
      "defoaming agent"
    ]
  },
  {
    "name": "Antioxidant",
    "description": "Antioxidants are substances which prolong the shelf-life of foods by protecting them against deterioration caused by oxidation, such as fat rancidity and colour changes.",
    "usedAs": [
      "antibrowning agent",
      "antioxidant",
      "antioxidant synergist"
    ]
  },
  {
    "name": "Bleaching agent",
    "description": "A food additive -non-flour use- used to decolourize food. Bleaching agents do not include pigments.",
    "usedAs": [
      "bleaching agent"
    ]
  },
  {
    "name": "Bulking agent",
    "description": "Bulking agents are substances which contribute to the volume of a foodstuff without contributing significantly to its available energy value.",
    "usedAs": [
      "bulking agent",
      "filler"
    ]
  },
  {
    "name": "Carbonating agent",
    "description": "A food additive used to provide carbonation in a food.",
    "usedAs": [
      "carbonating agent"
    ]
  },
  {
    "name": "Carrier",
    "description": "A food additive used to dissolve, dilute, disperse or otherwise physically modify a food additive or nutrient without altering its function -and without exerting any technological effect itself- in order to facilitate its handling, application or use of the food additive or nutrient.",
    "usedAs": [
      "carrier",
      "carrier solvent",
      "diluent for other food additives",
      "encapsulating agent",
      "nutrient carrier"
    ]
  },
  {
    "name": "Colour",
    "description": "Colours are substances which add or restore colour in a food, and include natural constituents of foods and natural sources which are normally not consumed as foods as such and not normally used as characteristic ingredients of food.",
    "usedAs": [
      "colour",
      "decorative pigment",
      "surface colorant"
    ]
  },
  {
    "name": "Colour retention agent",
    "description": "A food additive, which stabilizes, retains or intensifies the colour of a food.",
    "usedAs": [
      "color adjunct",
      "colour fixative",
      "colour retention agent",
      "colour stabilizer"
    ]
  },
  {
    "name": "Emulsifier",
    "description": "Emulsifiers are substances which make it possible to form or maintain a homogenous mixture of two or more immiscible phases such as oil and water in a foodstuff.",
    "usedAs": [
      "clouding agent",
      "crystallization inhibitor",
      "density adjustment agent (flavouring oils in beverages)",
      "dispersing agent",
      "emulsifier",
      "plasticizer",
      "surface active agent",
      "suspension agent"
    ]
  },
  {
    "name": "Emulsifying salt",
    "description": "A food additive, which, in the manufacture of processed food, rearranges proteins in order to prevent fat separation.",
    "usedAs": [
      "emulsifying salt",
      "emulsifying salt synergist",
      "melding salt"
    ]
  },
  {
    "name": "Firming agent",
    "description": "Firming agents are substances which make or keep tissues of fruit or vegetables firm or crisp, or interact with gelling agents to produce or strengthen a gel.",
    "usedAs": [
      "firming agent"
    ]
  },
  {
    "name": "Flavour enhancer",
    "description": "Flavour enhancers are substances which enhance the existing taste and/or odour of a foodstuff.",
    "usedAs": [
      "flavour enhancer",
      "flavour synergist"
    ]
  },
  {
    "name": "Flour treatment agent",
    "description": "Flour treatment agents are substances, other than emulsifiers, which are added to flour or dough to improve its baking quality.",
    "usedAs": [
      "dough conditioner",
      "dough strengthening agent",
      "flour bleaching agent",
      "flour improver",
      "flour treatment agent"
    ]
  },
  {
    "name": "Foaming agent",
    "description": "Foaming agents are substances which make it possible to form a homogenous dispersion of a gaseous phase in a liquid or solid foodstuff.",
    "usedAs": [
      "aerating agent",
      "foaming agent",
      "whipping agent"
    ]
  },
  {
    "name": "Gelling agent",
    "description": "Gelling agents are substances which give a foodstuff texture through formation of a gel.",
    "usedAs": [
      "gelling agent"
    ]
  },
  {
    "name": "Glazing agent",
    "description": "Glazing agents -including lubricants- are substances which, when applied to the external surface of a foodstuff, impart a shiny appearance or provide a protective coating.",
    "usedAs": [
      "coating agent",
      "film forming agent",
      "glazing agent",
      "polishing agent",
      "sealing agent",
      "surface-finishing agent"
    ]
  },
  {
    "name": "Humectant",
    "description": "Humectants are substances which prevent foods from drying out by counteracting the effect of an atmosphere having a low degree of humidity, or promote the dissolution of a powder in an aqueous medium.",
    "usedAs": [
      "humectant",
      "moisture/water retention agent",
      "wetting agent"
    ]
  },
  {
    "name": "Packaging gas",
    "description": "A food additive gas, which is introduced into a container before, during or after filling with food with the intention to protect the food, for example, from oxidation or spoilage.",
    "usedAs": [
      "packaging gas"
    ]
  },
  {
    "name": "Preservative",
    "description": "Preservatives are substances which prolong the shelf-life of foods by protecting them against deterioration caused by micro-organisms and/or which protect against growth of pathogenic micro-organisms.",
    "usedAs": [
      "antimicrobial preservative",
      "antimicrobial synergist",
      "antimould and antirope agent",
      "antimycotic agent",
      "bacteriophage control agent",
      "fungistatic agent",
      "preservative"
    ]
  },
  {
    "name": "Propellant",
    "description": "A food additive gas, which expels a food from a container.",
    "usedAs": [
      "propellant"
    ]
  },
  {
    "name": "Raising agent",
    "description": "Raising agents are substances or combinations of substances which liberate gas and thereby increase the volume of a dough or a batter.",
    "usedAs": [
      "raising agent"
    ]
  },
  {
    "name": "Sequestrant",
    "description": "Sequestrants are substances which form chemical complexes with metallic ions.",
    "usedAs": [
      "sequestrant"
    ]
  },
  {
    "name": "Stabilizer",
    "description": "A food additive, which makes it possible to maintain a uniform dispersion of two or more components.",
    "usedAs": [
      "binder",
      "colloidal stabilizer",
      "emulsion stabilizer",
      "foam stabilizer",
      "stabilizer",
      "stabilizer synergist"
    ]
  },
  {
    "name": "Sweetener",
    "description": "Sweeteners are substances used to impart a sweet taste to foods or in table-top sweeteners.",
    "usedAs": [
      "bulk sweetener",
      "intense sweetener",
      "sweetener"
    ]
  },
  {
    "name": "Thickener",
    "description": "Thickeners are substances which increase the viscosity of a foodstuff.",
    "usedAs": [
      "binder",
      "bodying agent",
      "texturizing agent",
      "thickener",
      "thickener synergist"
    ]
  }
  ]
}
