{
  "updatedAt": "2025-10-12T02:50:29.281Z",
  "answers": [
    {
      "q": "granules of karaya gum and sennosides how to use",
      "a": "Use exactly as directed on the product label: typically taken by mouth with a full glass of water (often at bedtime), because karaya gum is a bulk-former and sennosides are stimulant laxatives. Do not use longer than a week without medical advice, avoid if you have bowel obstruction, and separate from other oral medicines by at least 2 hours.",
      "answeredAt": "2025-10-12T02:50:29.281Z"
    },
    {
      "q": "how much does medicare/ medicaid allow for karaya 5 802932-413 adhesive per month",
      "a": "Karaya-based ostomy barriers like Karaya 5 are usually billed under Medicare HCPCS skin‑barrier codes (e.g., A4362), for which Medicare commonly allows up to about 20 barriers per month when medically necessary. Exact brand coverage and quantities depend on your prescription and supplier billing; confirm with your DME supplier or plan using the correct HCPCS code, and note Medicaid limits vary by state.",
      "answeredAt": "2025-10-12T02:50:29.281Z"
    },
    {
      "q": "how much does medicare/ medicaid allow for karaya adheasive per monthve",
      "a": "If you mean karaya skin‑barrier paste, Medicare typically limits A4406 to about 4 oz per month; for solid karaya wafers (A4362), allowances are often up to roughly 20 per month when medically necessary. Medicaid policies differ by state, so verify your monthly allowance with your DME supplier using the appropriate HCPCS code.",
      "answeredAt": "2025-10-12T02:50:29.281Z"
    },
    {
      "q": "how to apply karaya gom powder",
      "a": "For ostomy care, clean and dry the skin, dust a very light layer of karaya (skin‑barrier) powder only on moist or denuded areas, gently tap off the excess, optionally seal with skin prep, then apply the barrier/device; using too much can reduce adhesion. Do not use on open wounds unless directed by a clinician.",
      "answeredAt": "2025-10-12T02:50:29.281Z"
    },
    {
      "q": "how to be karaya gum supplier",
      "a": "Source from reliable Sterculia producers and ensure the material meets food‑grade E416 specifications (e.g., FCC/Ph. Eur./EU 231/2012) under GMP with COAs, traceability, and contaminant controls. Obtain required registrations and import/export clearances for your markets (e.g., FDA food facility in the U.S. or EU food business registration) and be prepared to provide safety data and allergen statements to buyers.",
      "answeredAt": "2025-10-12T02:50:29.281Z"
    }
  ]
}
