{
  "updatedAt": "2025-10-12T02:38:53.893Z",
  "answers": [
    {
      "q": "what food has red dye 3",
      "a": "In countries where azorubine (E122, also called carmoisine) is allowed, it’s used in sweets and gummies, cakes and biscuits, dessert mixes/puddings, jams/jellies, syrups and flavored drinks, and in heat-treated fruit preparations for yogurts. It isn’t permitted in U.S. foods, and in the U.S. “Red Dye 3” usually refers to erythrosine (E127), a different additive.",
      "answeredAt": "2025-10-12T02:38:53.893Z"
    },
    {
      "q": "what food is red dye 3 in",
      "a": "Where permitted (e.g., EU/UK), azorubine (E122/carmoisine) appears in confectionery, baked goods, dessert mixes/puddings, jams/jellies, syrups, soft drinks, and heat-treated fruit preparations for yogurts. It’s not allowed in U.S. foods; in the U.S., “Red Dye 3” typically means erythrosine (E127), which is different.",
      "answeredAt": "2025-10-12T02:38:53.893Z"
    },
    {
      "q": "what food contains red dye 3",
      "a": "In regions that allow it, azorubine (E122/carmoisine) is used in candies, cakes/biscuits, dessert mixes and puddings, jams/jellies, syrups and flavored drinks, and heat-treated fruit preparations for yogurts. It’s not permitted in the U.S., where “Red Dye 3” commonly refers to erythrosine (E127), a separate colorant.",
      "answeredAt": "2025-10-12T02:38:53.893Z"
    },
    {
      "q": "what food have red dye 3",
      "a": "Foods that may contain azorubine (E122/carmoisine) where allowed include confectionery, baked goods, dessert mixes/puddings, jams/jellies, syrups, soft drinks, and heat-treated fruit preparations for yogurts. It isn’t approved in the U.S.; U.S. “Red Dye 3” generally means erythrosine (E127), which is different.",
      "answeredAt": "2025-10-12T02:38:53.893Z"
    },
    {
      "q": "what food has red 3",
      "a": "If you mean azorubine (E122/carmoisine), it’s used in sweets, cakes, dessert mixes/puddings, jams/jellies, syrups and flavored drinks, and heat-treated fruit preparations for yogurts in countries where it’s permitted. It’s not allowed in U.S. foods, and in the U.S. “Red 3” typically refers to erythrosine (E127), a different dye.",
      "answeredAt": "2025-10-12T02:38:53.893Z"
    }
  ]
}
