{
  "updatedAt": "2025-10-12T02:34:34.963Z",
  "answers": [
    {
      "q": "what foods to avoid that have e472 tartatic and esters of mono and diglyerides",
      "a": "Common sources include packaged breads and rolls, cakes, pastries, biscuits, pie crusts, margarines/spreads, ice cream and frozen desserts, non‑dairy creamers/whipped toppings, confectionery fillings, and some sauces/dressings. Check labels for E472 (a–f), “tartaric acid esters of mono- and diglycerides,” or “DATEM” (E472e).",
      "answeredAt": "2025-10-12T02:34:34.963Z"
    },
    {
      "q": "what is e471 and e472",
      "a": "E471 is mono- and diglycerides of fatty acids—an emulsifier made from fats and glycerol that helps mix oil and water and improve texture. E472 is a family of related emulsifiers formed by reacting those mono-/diglycerides with food acids (acetic, lactic, citric, tartaric) and is widely authorized for similar uses in foods.",
      "answeredAt": "2025-10-12T02:34:34.963Z"
    },
    {
      "q": "what is e472 d tartaric acid esters of mono and diglycerides?",
      "a": "E472d is the tartaric acid esters of mono- and diglycerides, an emulsifier and dough conditioner used in bakery fats, breads, cakes, and whipped/creaming products. It is authorized in many countries; note that E472e (DATEM) is a different, acetylated tartaric ester.",
      "answeredAt": "2025-10-12T02:34:34.963Z"
    },
    {
      "q": "what is e472 in food",
      "a": "E472 refers to acid esters of mono- and diglycerides of fatty acids—emulsifiers that stabilize oil–water mixtures, improve dough strength and crumb, and help prevent separation or staling in products like bread, cakes, spreads, and desserts. They can be listed as E472a–f or by names such as lactic/citric/tartaric acid esters or DATEM (E472e).",
      "answeredAt": "2025-10-12T02:34:34.963Z"
    },
    {
      "q": "what is e472 of tartaric acid essters of mono and diglycerides?",
      "a": "It’s the E472d subtype: tartaric acid esters of mono- and diglycerides, used as an emulsifier and dough improver in bakery and aerated dessert applications. It helps stabilize emulsions and texture and is permitted under food additive regulations in many regions.",
      "answeredAt": "2025-10-12T02:34:34.963Z"
    }
  ]
}
