{
  "updatedAt": "2025-10-12T02:42:05.696Z",
  "answers": [
    {
      "q": "how much sodium sesquicarbonate added to laundry sop",
      "a": "As a laundry booster, use about 1–2 tablespoons (15–30 g) per standard load; in a DIY powder detergent, it’s typically 5–15% of the formula by weight. Dissolve well and avoid use on wool or silk.",
      "answeredAt": "2025-10-12T02:42:05.696Z"
    },
    {
      "q": "how ro clean bronze with sodium sesquicarbonate",
      "a": "Conservators often use a 5% w/v solution (about 50 g per liter of deionized water) to soak bronze affected by “bronze disease,” changing the solution periodically until activity ceases, then rinse, dry thoroughly, and apply a protective coating. Always test on a small area first and avoid prolonged contact with sound patina.",
      "answeredAt": "2025-10-12T02:42:05.696Z"
    },
    {
      "q": "how to make sodium sesquicarbonate",
      "a": "Combine equimolar sodium carbonate (washing soda) and sodium bicarbonate (baking soda) in water—e.g., 106 g Na2CO3 with 84 g NaHCO3—then allow the double salt to crystallize, filter, and dry. For food applications, purchase certified-grade material rather than making it at home to ensure purity and composition.",
      "answeredAt": "2025-10-12T02:42:05.696Z"
    },
    {
      "q": "is sodium sesquicarbonate safe",
      "a": "Yes—E500(iii) is an approved food additive used as an acidity regulator/raising agent and is considered safe at typical use levels; it mainly contributes sodium and alkalinity. Excess exposure can irritate eyes/skin or upset the stomach, so handle the powder carefully and follow normal use levels.",
      "answeredAt": "2025-10-12T02:42:05.696Z"
    },
    {
      "q": "sodium sesquicarbonate what is it used for",
      "a": "In foods (E500iii) it serves as an acidity regulator, buffer, and leavening agent. Beyond food, it’s used as a detergent builder/water softener, mild alkaline cleaner, pH buffer in baths, and in conservation treatments for bronze.",
      "answeredAt": "2025-10-12T02:42:05.696Z"
    }
  ]
}
