{
  "updatedAt": "2025-10-12T02:39:32.098Z",
  "answers": [
    {
      "q": "is sodium nitrite bad for you",
      "a": "In regulated amounts used in cured meats, it’s considered safe and helps prevent botulism; EFSA’s acceptable daily intake (ADI) for nitrite is 0.07 mg/kg body weight per day from all sources. High doses can cause methemoglobinemia and can promote nitrosamine formation, so use levels are strictly limited.",
      "answeredAt": "2025-10-12T02:39:32.098Z"
    },
    {
      "q": "what is sodium nitrite used for",
      "a": "Primarily to cure and preserve meats, where it inhibits Clostridium botulinum, stabilizes the pink color, and contributes to flavor.",
      "answeredAt": "2025-10-12T02:39:32.098Z"
    },
    {
      "q": "how much sodium nitrite is deadly",
      "a": "Direct ingestion can be life‑threatening even in relatively small amounts due to methemoglobinemia; do not consume it outside properly formulated foods. If you’re concerned about exposure or personal safety, contact poison control or emergency services right away.",
      "answeredAt": "2025-10-12T02:39:32.098Z"
    },
    {
      "q": "does sodium nitrite cause cancer",
      "a": "Nitrite itself isn’t classified as a human carcinogen, but it can form carcinogenic N‑nitrosamines under certain conditions; IARC classifies ingested nitrate/nitrite under conditions leading to endogenous nitrosation as probably carcinogenic (Group 2A). Regulators cap nitrite levels and often require ascorbate/erythorbate to limit nitrosamine formation.",
      "answeredAt": "2025-10-12T02:39:32.098Z"
    },
    {
      "q": "how to buy sodium nitrite",
      "a": "Because of toxicity and regulatory controls, it’s typically sold through reputable food‑ingredient suppliers, often only as pre‑mixed curing salts with low nitrite percentages; purchase and use must follow local laws and label directions. For legitimate culinary use, seek guidance on safe handling and approved formulations; if you’re looking for it due to thoughts of self‑harm, please seek immediate help from local emergency services or a crisis hotline.",
      "answeredAt": "2025-10-12T02:39:32.098Z"
    }
  ]
}
